[{"App Name": "Signal", "Request Number": "#455", "Title": "Signature below SMS message", "Author": "jandechent", "Posted Time": "Dec 4, 2013", "Initial Comment": "Hi,in oder to advertise TextSecure to my friends I'd like to add a (short) signature. E.g.   I use TextSecure for private and secure communication!  do you find this worth implementing?", "CommitURL": "N/a", "Number of comments": 5, "CommentatorsNames": ["jandechent", "SevenFactors", "meskio", "jlund", "generalmanager", "automated-signal"], "Number of Commentators": 6, "All Comments": [{"Text: ": "Hi,in oder to advertise TextSecure to my friends I'd like to add a (short) signature. E.g.   I use TextSecure for private and secure communication!  do you find this worth implementing?", "Images: ": []}, {"Text: ": "I would like to see this feature so I can promote TextSecure. I would like to be able to share such signature just as I would hare an emoji or attachments.For example: Button Press > [I'm given the option to insert a pre-confirgured message OR my own pre-configured message with a hard-set pre-configured link to the TextSecure play store page.  I wouldn't like to be forced between including & not including the promotional signature with all unencrypted messages.  In other words, a simplified way to share the TextSecure play.store page link from within TextSecure rather than having to: Go to Play Store > TextSecure Page > Share > Fine App {TextSecure]", "Images: ": []}, {"Text: ": "I think the 160 characters of a sms is a bit short to include a signature. Besides I personally find annoying to see signatures longer than the message itself, I kind of hate the 'send from my iphone' signature. If this gets included I think this should be disabled by default.", "Images: ": []}, {"Text: ": "Apparently some industries require every outgoing message to contain a signature. Realtors in California, for example, must attach their name, company name, and phone number to every SMS they send. This recently came through as a request to the Support Center, so I'm passing it along here. I definitely agree that it should be disabled by default, but giving users the ability to customize a signature would be a nice feature.", "Images: ": []}, {"Text: ": "+1 for disabled by default. We can just give people the possibility to add a signature and the default signature when activated is some short TS promotion slogan.", "Images: ": []}, {"Text: ": "GitHub Issue Cleanup:See#7598for more information.  #7598", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#1875", "Title": "Import backup: Please tell me how old the backup is I am going to import", "Author": "hacklschorsch", "Posted Time": "Aug 27, 2014", "Initial Comment": "I would like the 'import backup' screen, that asks me whether I want to continue (\"... will completely replace your existing keys, preferences, and messages\"), to tell me the date of the backup I am going to import. (I mistakenly thought TS would automatically, regularly, create encrypted backups (like it should be, IMHO) and imported a backup from February -- half a year of messages and photos gone. Didn't know about#1631) #1631", "CommitURL": "N/a", "Number of comments": 4, "CommentatorsNames": ["hacklschorsch", "hacklschorsch", "generalmanager", "hacklschorsch", "automated-signal"], "Number of Commentators": 5, "All Comments": [{"Text: ": "I would like the 'import backup' screen, that asks me whether I want to continue (\"... will completely replace your existing keys, preferences, and messages\"), to tell me the date of the backup I am going to import. (I mistakenly thought TS would automatically, regularly, create encrypted backups (like it should be, IMHO) and imported a backup from February -- half a year of messages and photos gone. Didn't know about#1631) #1631", "Images: ": []}, {"Text: ": "Shouting out to@mcgintyas I believe she is/was working on the backup thing. @mcginty", "Images: ": []}, {"Text: ": "Sounds like a good idea to me. Btw: mcginty is a he ;)", "Images: ": []}, {"Text: ": "Ah, thx!", "Images: ": []}, {"Text: ": "GitHub Issue Cleanup:See#7598for more information.  #7598", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#176", "Title": "Feature: Automatic deletion of old messages", "Author": "coiax", "Posted Time": "May 23, 2013", "Initial Comment": "In the spirit ofhttps://ssd.eff.org/your-computer/protect/retentionhaving deletion of messages older than a certain amount is probably good practice. I previously used an automated tool to delete SMS messages older than 30 days, but since TextSecure uses its own database, this no longer works. https://ssd.eff.org/your-computer/protect/retention Having the option for TextSecure to delete messages older than X (reuse of the passphrase timeout selector would be fine) would be highly helpful.", "CommitURL": "N/a", "Number of comments": 3, "CommentatorsNames": ["coiax", "coiax", "generalmanager", "rhodey"], "Number of Commentators": 4, "All Comments": [{"Text: ": "In the spirit ofhttps://ssd.eff.org/your-computer/protect/retentionhaving deletion of messages older than a certain amount is probably good practice. I previously used an automated tool to delete SMS messages older than 30 days, but since TextSecure uses its own database, this no longer works. https://ssd.eff.org/your-computer/protect/retention Having the option for TextSecure to delete messages older than X (reuse of the passphrase timeout selector would be fine) would be highly helpful.", "Images: ": []}, {"Text: ": "I'm going to try to see if I can hack together some code to do this, watch this space.", "Images: ": []}, {"Text: ": "Are you going to work on this again, or are you happy with the message-based approach we have now instead of the time-based one? If you are not going to pursue or ask for it further, can you please close the ticket? Thanks!", "Images: ": []}, {"Text: ": "Settings > Delete old messages >check box check box", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#1133", "Title": "Deletion of contact keys", "Author": "Waboru", "Posted Time": "Mar 12, 2014", "Initial Comment": "Hello moxie, could you please let us delete the contact keys? Several of my friends changed their number or uninstalled TextSecure, I'm not liking to scroll threw their contact keys whenever I check them.Let us long press them for deleting, add a warning and everything would be fine.", "CommitURL": "N/a", "Number of comments": 4, "CommentatorsNames": ["Waboru", "tinloaf", "moxie0", "Waboru", "2-4601"], "Number of Commentators": 5, "All Comments": [{"Text: ": "Hello moxie, could you please let us delete the contact keys? Several of my friends changed their number or uninstalled TextSecure, I'm not liking to scroll threw their contact keys whenever I check them.Let us long press them for deleting, add a warning and everything would be fine.", "Images: ": []}, {"Text: ": "This is a duplicate of#682... #682", "Images: ": []}, {"Text: ": "@WaboruThere are ~500 open issues here now. We've got a lot to do. The best way to help is by commenting on other issues in order to get them resolved, doing research into possible solutions, finding and closing duplicates, answering common questions, or even submitting PRs.  Whatdoesn'thelp is posting the same comment twice in a row, which just generates more email for all of us to read when we're already overwhelmed with it. @Waboru doesn't", "Images: ": []}, {"Text: ": "I'm sorry, I reposted it because the other issue was closed. So I thought you won't think about adding this feature anymore.Won't happen again, sorry!  Could you please tell me if it's planned? Thanks a lot for your great work moxie. :)", "Images: ": []}, {"Text: ": "Closing as duplicate of#682(plus obsolete features) #682", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#5529", "Title": "Disable \"Screen security\" by default", "Author": "2-4601", "Posted Time": "Jun 9, 2016", "Initial Comment": "I have: searched open and closed issues for duplicatesreadhttps://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports searched open and closed issues for duplicates  readhttps://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports  https://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports  Feature description It's quite common to see non-passphrase users wonder why screenshots in Signal don't work. It probably doesn't make sense to haveScreen securityenabled by default for them.For passphrase users it makes sense. Screen security  One option would be to remove the feature completely from settings and make it an implicit feature which depends on the passphrase setting. In#1431 (comment)moxie0 wrote:[The Screen security feature i]s not designed to prevent screenshots, it's designed to notify the task manager that it shouldn't cache screenshots of conversations. The side effect is that it prevents screenshots. In#1431 (comment)moxie0 wrote:[The Screen security feature i]s not designed to prevent screenshots, it's designed to notify the task manager that it shouldn't cache screenshots of conversations. The side effect is that it prevents screenshots. #1431 (comment)", "CommitURL": "https://github.com/signalapp/Signal-Android/commit/ba849bce2c90287e820a3008e9dc9a1b14de19fc/hovercard", "Number of comments": 5, "CommentatorsNames": ["2-4601", "haffenloher", "johanw666", "moxie0", "2-4601", "2-4601"], "Number of Commentators": 6, "All Comments": [{"Text: ": "I have: searched open and closed issues for duplicatesreadhttps://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports searched open and closed issues for duplicates  readhttps://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports  https://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports  Feature description It's quite common to see non-passphrase users wonder why screenshots in Signal don't work. It probably doesn't make sense to haveScreen securityenabled by default for them.For passphrase users it makes sense. Screen security  One option would be to remove the feature completely from settings and make it an implicit feature which depends on the passphrase setting. In#1431 (comment)moxie0 wrote:[The Screen security feature i]s not designed to prevent screenshots, it's designed to notify the task manager that it shouldn't cache screenshots of conversations. The side effect is that it prevents screenshots. In#1431 (comment)moxie0 wrote:[The Screen security feature i]s not designed to prevent screenshots, it's designed to notify the task manager that it shouldn't cache screenshots of conversations. The side effect is that it prevents screenshots. #1431 (comment)", "Images: ": []}, {"Text: ": "Disabling it by default may be a good idea. But why the distinction between people using a passphrase and people who don't? I imagine that if theScreen securitysetting changes automagically when people change the passphrase setting, this could create additional confusion. Screen security", "Images: ": []}, {"Text: ": "One option would be to remove the feature completely from settings and make it an implicit feature which depends on the passphrase setting. One option would be to remove the feature completely from settings and make it an implicit feature which depends on the passphrase setting. That would making screenshots in case of issues complicated. Changing the default might work, but removing the option completely seems a bit overdone to me.", "Images: ": []}, {"Text: ": "I'm fine with disabling it by default.", "Images: ": []}, {"Text: ": "But why the distinction between people using a passphrase and people who don't? But why the distinction between people using a passphrase and people who don't? Just thought that a passphrase user would not expect to see a screenshot of a conversation in the recents list after they have locked the app. But I guess it's true that disabling theScreen securityfor all users by default is the most straightforward way. Screen security", "Images: ": []}, {"Text: ": "Was handled in ba849bc5270dad ba849bc ba849bc ba849bc 5270dad 5270dad 5270dad", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#1055", "Title": "drafts should be marked and moved to top of list ", "Author": "JayPiEs", "Posted Time": "Mar 6, 2014", "Initial Comment": "the message drafts should be automatically moved to the top of the message-list and be marked somehow, i.e. get another color or a text \"Draft\"", "CommitURL": "/signalapp/Signal-Android/commit/f5724795cf1ced0360a02338c25491629527a3eb/hovercard", "Number of comments": 4, "CommentatorsNames": ["JayPiEs", "McLoo", "hunleyd", "landry314", "backspace"], "Number of Commentators": 5, "All Comments": [{"Text: ": "the message drafts should be automatically moved to the top of the message-list and be marked somehow, i.e. get another color or a text \"Draft\"", "Images: ": []}, {"Text: ": "I totally second this.Though i would not need it to be moved to the top.  I often get disturbed when writing which leads to drafts I forget to send. How would i now if not marked somehow? If not show it by a text or a symbol, how about showing the text in conversation list and change the font style to italic (red color would also work, except for color blind people i guess!)?", "Images: ": []}, {"Text: ": "+1", "Images: ": []}, {"Text: ": "absolutely!! but definitely move the draft threads to the TOP of the list as if they were just sent from. i start to write a message then i need to leave the app for a second and it saves a draft but it does not move the thread with that draft to the top of the list so when i come back to finish my draft i have to scroll down to find the thread. this is very tedious.", "Images: ": []}, {"Text: ": "Yes, I would like this too. I think I could figure out how to add this, but do the maintainers agree that it should be?", "Images: ": []}]}, {"App Name": "Mastodon", "Request Number": "#107", "Title": "Can't view image descriptions", "Author": "juliloving", "Posted Time": "May 2, 2022", "Initial Comment": "I know a screen reader can still read them, but it's important to me to see if there IS a description so I know if I can boost these posts to my disabled followers", "CommitURL": "N/a", "Number of comments": 2, "CommentatorsNames": ["juliloving", "realpixelcode", "grishka"], "Number of Commentators": 3, "All Comments": [{"Text: ": "I know a screen reader can still read them, but it's important to me to see if there IS a description so I know if I can boost these posts to my disabled followers", "Images: ": []}, {"Text: ": "I'd like to be able to view image descriptions without having to use a screen reader. 🤷 Maybe a duplicate?#100 #100", "Images: ": []}, {"Text: ": "Duplicate of#100 Duplicate of #100", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#969", "Title": "Color incoming messages in groups according to author", "Author": "tinloaf", "Posted Time": "Mar 3, 2014", "Initial Comment": "Since there's so many UX experts around lately, I want to propose this: In groups, I always find it kind of annoying to have to read the name of the sender of a message. Somehow that distracts me from the actual messages. What do you think about this: In a group message, every incoming message is colored based on the author. Basically, we'd need a \"string to RGB\" hash function (shouldn't be that hard) and then color the background of their messages with 20% opacity (or so..) That way, I know that everything that's green is from my Buddy Bob, and everything that's yellow is from Alice, and I can just read the whole conversation without reading the name in front of every single message...", "CommitURL": "N/a", "Number of comments": 9, "CommentatorsNames": ["tinloaf", "tinloaf", "sendiulo", "generalmanager", "mcginty", "tinloaf", "tinloaf", "generalmanager", "tinloaf", "generalmanager"], "Number of Commentators": 10, "All Comments": [{"Text: ": "Since there's so many UX experts around lately, I want to propose this: In groups, I always find it kind of annoying to have to read the name of the sender of a message. Somehow that distracts me from the actual messages. What do you think about this: In a group message, every incoming message is colored based on the author. Basically, we'd need a \"string to RGB\" hash function (shouldn't be that hard) and then color the background of their messages with 20% opacity (or so..) That way, I know that everything that's green is from my Buddy Bob, and everything that's yellow is from Alice, and I can just read the whole conversation without reading the name in front of every single message...", "Images: ": []}, {"Text: ": "Now that I think about it, another idea: Don't color the messages but the avatars. Obviously, this issue does not arise with people who have profile pictures. So if they don't, they have an avatar. We could just uniquely color that avatar instead of the whole message, if that would be too much color...", "Images: ": []}, {"Text: ": "+1 to coloring the avatars! Btw, telegram does so too.", "Images: ": []}, {"Text: ": "@tinloaf: yes, coloring the avatars is a good idea. But I wouldn't just try to \"randomly\" generate a color.You don't want to insert random colors, that'd look horrible. But we can have a rather big preset, from which each contact gets one permanently as soon as he joyns his first group. @tinloaf  The colors should of course also be user-selectable. And for real power-users a color picker would be useful.", "Images: ": []}, {"Text: ": "I think something similar to how gmail does avatar coloring (with our without the massive letter) would be in order. It'd be something simple and uncomplicated to both break the monotony of the same image being repeated many places, and adding distinction and uniqueness for each contact.", "Images: ": []}, {"Text: ": "I don't have gmail, but if it's anything like K-9 mail, I know what you mean. Yeah, I like that idea, I just did not yet come up with a good color-selection-idea. I'm afraid that@Lindwormis correct in that choosing the colors \"randomly\" (by hashing the contact) results in ugly colors. Perhaps I should have a look at how K-9 does it. @Lindworm Update: Do you think it's neccessary that the colors stay the same across multiple groups? I.e. that Jon Doe is always yellow? Otherwise, we could just assign a relatively small palette (20 colors or so) and map the list of participants to it... Update", "Images: ": []}, {"Text: ": "I build this, have a look at#1027. There I use a solution that determines the color based on the contact's name, so it should be consistent across multiple group chats. We could use some more colors though, I guess. #1027", "Images: ": []}, {"Text: ": "@tinloafnice, is it also possible to  set the colors manually? I fear that's going to be the first thing they cry for..nobody wants to be cyan ;-) @tinloaf", "Images: ": []}, {"Text: ": "Well, no.. this would mean we actually have to store something somewhere, and that's always messy (you have to have a Database, write some database wrapping code, code for setting the data manually...) I honestly don't think that the complexity this would add would be justified by \"my friend Alice doesn't want to be green.\" ;)", "Images: ": []}, {"Text: ": "@tinloafI really fear that's going to be an issue. Not for me, but for the average user. People love to custimize their stuff, and many are quiet emotional regarding colors. Have you ever been able to play a game of Ludo (\"Mensch ärgere dich nicht\" in German) without fighting who gets to be red and blue? ;-) @tinloaf", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#312", "Title": "Need Batch Selection Mode for individual messages inside a conversation", "Author": "dang357", "Posted Time": "Aug 17, 2013", "Initial Comment": "Deleting individual messages from a conversation is cumbersome and inefficient (Hold down on a message, then select Delete from popup menu, then select Yes on confirmation message, one message at a time). By way of contrast, holding down on a conversation in the Conversations list initiates Batch Selection Mode, allowing user to select multiple conversations for an action (currently Delete is the only option). Being able to trim out fluff from a conversation but keep important messages would be a valuable feature. A similar Batch Selection Mode for individual messages within a conversation (as already exists in the default Android Text Message app) would provide this functionality.", "CommitURL": "N/a", "Number of comments": 2, "CommentatorsNames": ["dang357", "generalmanager", "mcginty"], "Number of Commentators": 3, "All Comments": [{"Text: ": "Deleting individual messages from a conversation is cumbersome and inefficient (Hold down on a message, then select Delete from popup menu, then select Yes on confirmation message, one message at a time). By way of contrast, holding down on a conversation in the Conversations list initiates Batch Selection Mode, allowing user to select multiple conversations for an action (currently Delete is the only option). Being able to trim out fluff from a conversation but keep important messages would be a valuable feature. A similar Batch Selection Mode for individual messages within a conversation (as already exists in the default Android Text Message app) would provide this functionality.", "Images: ": []}, {"Text: ": "I think this should be closed as a duplicate. This issue is a lot older, but#786is way more active. #786", "Images: ": []}, {"Text: ": "agree, thanks!", "Images: ": []}]}, {"App Name": "Signal", "Request Number": "#2098", "Title": "Automatically resend undelivered messages", "Author": "janvlug", "Posted Time": "Nov 15, 2014", "Initial Comment": "Since the delivery confirmation functionality has been implemented, I sent 48 messages. For 3 of these, I did not get a confirmation that they have been delivered. It would be nice if messages are automatically resent if no delivery confirmation is received. Especially, if later messages to the same recipient do get a delivery confirmation, indicating that the recipient is reachable again.", "CommitURL": "N/a", "Number of comments": 14, "CommentatorsNames": ["janvlug", "ghost", "DavidNiehues", "janvlug", "janvlug", "DavidNiehues", "JanKanis", "rbu", "ghost", "rbu", "ghost", "devurandom", "janvlug", "rhodey", "janvlug"], "Number of Commentators": 15, "All Comments": [{"Text: ": "Since the delivery confirmation functionality has been implemented, I sent 48 messages. For 3 of these, I did not get a confirmation that they have been delivered. It would be nice if messages are automatically resent if no delivery confirmation is received. Especially, if later messages to the same recipient do get a delivery confirmation, indicating that the recipient is reachable again.", "Images: ": []}, {"Text: ": "I think you're missing the point.The app shouldn't resend messages that are not delivered. Messages should ALWAYS be delivered (if the recipient is online of course), period. What I don't get is why messages stopped being delivered since they introduced delivery receipts. THAT'S the bug for how I see it.", "Images: ": []}, {"Text: ": "The question is in which way the delivery receipts are implemented. Maybe just the delivery receipts are lost or not send for some reasons. Maybe@moxie0can assist wtih some clarification here. @moxie0", "Images: ": []}, {"Text: ": "@Manhole11true, messages should always be delivered. It's merely that since the delivery confirmation it becomes clear that this is apparently not always the case.@Dave1704 I will try to verify with the recipient if the messages did arrive, and if only the delivery receipts were lost. @Manhole11", "Images: ": []}, {"Text: ": "@Dave1704  I checked with the recipient. I could only check for two unconfirmed messages because the rest was already deleted. These two messages did arrive, but I did not get the confirmation. So it looks like that the confirmations get lost.", "Images: ": []}, {"Text: ": "It's good to know which messages are lost. But I can't really do something about it. I'm no developer here. I just check the issues and try to assist as much as I'm able to.", "Images: ": []}, {"Text: ": "I'm having similar problems, but for me sometimes the original message does not delivered, so it is not just confirmations that don't arrive", "Images: ": []}, {"Text: ": "The original message and its receipt use the same transmission channel (both are just \"messages\" on the GCM service), and since this channel is prone to data loss, either message could be lost and the message would be shown \"unconfirmed\" to the sender. In practice, one could assume half the unconfirmed messages would be lost. @Manhole11, while it may be worthwhile to improve reliability between the intermediate server (e.g. GCM) and the receiver, full reliability can only be achieved end-to-end, which means there must be a retransmission mechanism that is triggered by the sender's TextSecure application. After all, the message may even be lost before it reaches the GCM. @Manhole11", "Images: ": []}, {"Text: ": "\"..and since this channel is prone to data loss..\" this is true for any channel, however this problem happens only when using textsecure. All my other applications work just fine.I don't think it's a problem with the channel...", "Images: ": []}, {"Text: ": "@Manhole11, do you have a specific other application in mind that uses GCM and does not exhibit this problem? Do you know whether they have implemented retransmissions themselves? @Manhole11", "Images: ": []}, {"Text: ": "I don't know which other apps I have use GCM, the only thing I know is that textsecure is the only one having so many problems and I'll ditch it as soon as hemlis will be released. If GCM is the problem, then use something else. I mean, it's a problem of the developers. I don't care that much; all I care about is having an app that works and hemlis works :)", "Images: ": []}, {"Text: ": "Copying my issue description from#2293: #2293 Currently message delivery is unreliable. It often happens that I send a message to someone, but do not get a message receipt (check-mark icon). Messages sent later get a receipt. When I talk to the person a few hours later, they tell me they did not receive the message.This issue is not limited to me sending, but also happens the other way around. It also happens for other people, as I have been told. It also happens for the message receipts themselves – sometimes a message arrives on my phone, but the sender never receives the receipt. The CyanogenMod integrated WhisperPush service is not involved. The issue happens between stock Android users, as well as with CyanogenMod users.From reading other issues I understand that GCM does not offer reliable delivery. I wonder if the equivalent ofXEP-0198 section 4 \"Acks\"could be implemented on top of it in TextSecure.Possible duplicates:#679,#970,#1971,#2098,#2238 Currently message delivery is unreliable. It often happens that I send a message to someone, but do not get a message receipt (check-mark icon). Messages sent later get a receipt. When I talk to the person a few hours later, they tell me they did not receive the message. This issue is not limited to me sending, but also happens the other way around. It also happens for other people, as I have been told. It also happens for the message receipts themselves – sometimes a message arrives on my phone, but the sender never receives the receipt. The CyanogenMod integrated WhisperPush service is not involved. The issue happens between stock Android users, as well as with CyanogenMod users. From reading other issues I understand that GCM does not offer reliable delivery. I wonder if the equivalent ofXEP-0198 section 4 \"Acks\"could be implemented on top of it in TextSecure. XEP-0198 section 4 \"Acks\" Possible duplicates:#679,#970,#1971,#2098,#2238 #679 #970 #1971 #2098 #2238", "Images: ": []}, {"Text: ": "After some more investigation, I discovered that TextSecure at the recipients end crashes quite often while the app is in the background or the phone is suspend mode (see#2037). So in my case GCM is not the culprit.However, I made also the observation that messages sent to the user where TextSecure stopped working do not arrive anymore when TextSecure is started again. I would expect that GCM would still try to deliver them.However, whatever the cause of delivery problems is, GCM or TextSecure itself, it still would be great if additional attempts are made to resend the message until its delivery is confirmed. And yes, I understand that TextSecure cannot keep trying into eternity. #2037", "Images: ": []}, {"Text: ": "on second thought closing as dupe of#2015 #2015", "Images: ": []}, {"Text: ": "@rhodey: I'm not convinced that this is a dupe of#2015. This issue is not about the unavailability of a data connection, but about the fact that a message confirmation never arrives. The absence of a message delivery notification indicates that the message could not have reached the recipient. @rhodey #2015", "Images: ": []}]}]